[
    {
        "name": "Cryptocurrency trading application",
        "description": "This is a global cryptocurrency trading platform. Users can register, perform KYC and buy or sell or convert into multiple cryptocurrencies.",
        "image": "",
        "duration": "Currently working",
        "tags": [ "ReactJS", "Project Lead", "AWS S3", "AWS Cloudfront" ],
        "highlights": [
            "Working as a front-end <b>React JS</b> programmer",
            "Implemented a complex <b>refresh token logic</b> inside a <b>HTTP middileware</b>. Made it work for even simultaneous HTTP requests",
            "Implemented the aadhaar card third party integration that made the KYC step quicker",
            "Planned project execution and timelines as per dependencies",
            "Handled client communicationa nd integrated with client APIs"
        ]
    },
    {
        "name": "Telehealth application",
        "description": "US based medical application. It shows heart / lung recordings of a patients along with few questions asked to the patient. The admins can manage all patients, doctors and their appointments here",
        "image": "",
        "duration": "Currently working",
        "tags": [ "Angular 8", "Project Lead", "AWS cloudfront", "AWS SES", "AWS lambda", "AWS S3" ],
        "highlights": [
            "Working as a front-end <b>Angular 8</b> programmer",
            "Appreciated by client over work, ownership and clear communication",
            "Reduced 100% of validation and form errors by creating <b>reusable components</b> in the framework and setup standards together with team-members",
            "Converted existing <b>audio processing</b> code in <b>C to JS</b> to filter and hear sound in the web application",
            "Integrated <b>Twilio video call</b> feature in the angular application"
        ]
    },
    {
        "name": "Oil shipping activity tracking application",
        "description": "US based shipping activity tracking application. The software manages vessel's inventory, health and travel. All the metrics are recorded and updated in real time",
        "image": "",
        "duration": "1 year",
        "tags": [ "Angular 8", "Programmer" ],
        "highlights": [
            "Created the <b>base application framework</b> and setup standards together with team-members",
            "Appreciated for my efforts in creating a <b>common table component</b> with multiple plug and play features.",
            "Extensively used <b>common / reusable components</b> and reactive forms.",
            "Reduced 100% of validation and form errors by creating <b>reusable components</b> in the framework and setup standards together with team-members",
            "Converted existing <b>audio processing</b> code in <b>C to JS</b> to filter and hear sound in the web application",
            "Integrated <b>Twilio video call</b> feature in the angular application"
        ]
    },
    {
        "name": "Background verification application",
        "description": "A background verification application. Organisations can enroll and add their agents / HRs. These agents can then updload the candidates whose background verification needs to be done. Each of the candidates will get a link and they can continues the process. A report for each of the cadidate will be available for the agent to check.",
        "image": "",
        "duration": "3 years",
        "tags": [ "NodeJS", "Angular 2-4", "Programmer", "AWS SES/SNS", "AWS Lambda", "AWS RDS", "AWS Cloudfront", "AWS S3", "Firebase" ],
        "highlights": [
            "Started as a back-end programmer working in NodeJS & MySql. Soon played a full stack developer role handling front-end(Angular 2), back-end and production deployment",
            "Integrated <b>ReportJS</b> third party reducing the server communications work by 50% during report generations",
            "<b>Optimized performance</b> by implementing query optimisation, async processing, transaction pooling, vulnerability testing (SQL injection, HSTS, etc...), Load balancers, Child processes, etc...",
            "Setup and maintained development environment in <b>AWS cloud</b> with services like SNS, SES, Lambda, Cloudfront, EC2, RDS, S3 and firebase. Have provided support several times. With issue fix under 1-4hrs. Have received appreciation from the client on the same",
            "Maintained all client communications and change request processing"
        ]
    },
    {
        "name": "Finance management application ",
        "description": "An account management application that will sort the customer's billing book details and show financials",
        "image": "",
        "duration": "6 Months",
        "tags": [ "Angular 7", "Programmer", "AWS Cloudfront", "AWS S3" ],
        "highlights": [
            "Worked as a front-end developer (Angular 7) <b>upgraded the legacy application into the latest angular version</b>",
            "Have implemented complex functionalities like <b>drag and drop, tree wise recursive data structuring and processing</b>. Have received appreciation from the client on the same",
            "Effectively used polyfills to support the these complex functionalities available in legacy browser IE"
        ]
    },
    {
        "name": "Housing finanace application",
        "description": "Wordpress application of a leading finance company in India. The application hosts few custom interest calculators and housing plans.",
        "image": "",
        "duration": "2 Months",
        "tags": [ "WordPress", "PHP", "Programmer", "Apache" ],
        "highlights": [
            "Created the multiple <b>custom plugins</b> in the wordpress to implement custom housing loan interest calculation",
            "Created custom plugin to list, record and maintain the vaious <b>form submissions</b> in the wordpress application",
            "Migrated the wordpress application accross multiple server environments"
        ]
    }
]

